tap "jesseduffield/lazygit"
tap "pantsbuild/tap"
brew "libpng"
brew "coreutils"
brew "openssl@3"
brew "xz"
brew "curl"
brew "fzf"
brew "readline"
brew "gawk"
brew "geos"
brew "git"
brew "gnupg"
brew "python@3.13"
brew "neovim"
brew "opam"
brew "pipx"
brew "pkgconf"
brew "python@3.10"
brew "tcl-tk@8"
brew "virtualenv"
brew "virtualenvwrapper"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "pants"
cask "stats"
vscode "bradlc.vscode-tailwindcss"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "jdinhlife.gruvbox"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "raunofreiberg.vesper"
vscode "vue.volar"
vscode "wicked-labs.sequoia"
